<template>
	<view class="mask" v-if="bgflag">
		<view class="yinghangka" style="font-size: 24rpx;padding: 30rpx;">
			<scroll-view class="scroll-view" scroll-y="true" :scroll-top="scrollTop" @scroll="scroll" @scrolltoupper="upper"
			 @scrolltolower="lower">
			 <h3 style="margin: 40rpx;text-align: center;font-weight: 700;">敏智访客用户服务协议</h3>
				<p>为了更好地为您提供服务，请您仔细阅读本“用户服务协议及隐私保护政策”（以下简称 “本协议”）。
				<p style="font-weight: 600;">在您开始使用“敏智访客”软件及相关服务之前，请您务必认真阅读并充分理解本协议，特别是涉及免除或者限制责任的条款，权利许可和信息使用的条款，同意开通和使用特殊单项服务的条款，法律适用和争议解决条款等。其中，免除或者限制责任条款等重要内容您应重点阅读。如您未满18周岁，请您在法定监护人陪同下仔细阅读并充分理解本协议，并征得法定监护人的同意后下载本软件。
				除非您完全接受本协议的全部内容，否则您无权注册，登录，使用（以下统称 “使用”）“ 敏智访客”软件，或者通过任何方式使用“ 敏智访客”服务，或者获得“ 敏智访客”软件提供的任何服务（本协议中统称“使用”）。若您使用“
				敏智访客”软件及相关服务，则视为您已充分理解本协议并承诺作为本协议的一方当事人接受协议的约束。</p>
				<br/>
				1，适用范围<br/>

				<p>1.1本协议是您与“ 敏智访客”开发者（以下简称“我们”）之间就您注册，登录，使用“ 敏智访客”软件，并获得“ 敏智访客”软件提供的相关服务所订立的协议。我们有权依“
				敏智访客”软件及相关服务或运营的需要单方决定，安排或指定其关联我们，控制我们，继承我们或我们认可的第三方我们继续运营“
				敏智访客”软件。并且，就本协议项下涉及的某些服务，可能会由我们的关联我们，控制我们，继承我们或我们认可的第三方我们向您提供。您知晓并同意接受相关服务内容，即视为接受相关权利义务关系亦受本协议约束。
				</p>
				<p>1.2“用户”指所有直接或间接获取和使用“ 敏智访客”软件及相关服务的使用者，包括自然人，法人及其他组织等。在本协议中称为“用户”或称“您”。</p>

				<p>1.3“ 敏智访客”指由我们合法拥有并运营的，标注名称为“ 敏智访客”的小程序我们有权对应用程序及名称单方变更（包括但不限于更名，新增等）。</p>

				<p>1.4本协议内容同时包括我们已经发布及后续可能不断发布的关于“ 敏智访客”软件及相关服务的相关协议，规则等内容。前述内容一经正式发布，并以适当的方式送达用户（网站公布，系统通知等），即为本协议不可分割的组成部分，您应同样遵守。</p>
				<br/>
				2，使用“ 敏智访客”软件及相关服务<br/>

				<p>2.1您使用“ 敏智访客”软件及相关服务，可以通过微信小程序获取“ 敏智访客”小程序。若您并非从小程序获取本软件的，您因此遭受的损失与我们无关。</p>

				<p>2.2您可根据自行需要使用“ 敏智访客”软件及相关服务或更新“ 敏智访客”版本，如您不再需要使用“ 敏智访客”软件及相关服务可自行删除小程序。</p>

				<p>2.3为更好的提升用户体验及服务，我们将不定期提供软件更新或改变（包括但不限于软件修改，升级，功能强化，开发新服务，软件替换等）。为保证“
				敏智访客”软件及相关服务安全，提升用户服务，本软件及相关服务更新或部分服务内容更新后，在可能的情况下，我们将以包括但不限于系统提示，公告，站内信等方式提示用户，用户有权选择接受更新版本或服务，如用户不接受，部分功能将受到限制或不能继续使用。</p>

				<p>2.4除非得到我们明示事先书面授权，您不得以任何形式对“ 敏智访客”软件及相关服务进行包括但不限于改编，复制，传播，镜像或交易等未经授权的访问或使用。</p>

				<p>2.5您理解，您使用“ 敏智访客”软件及相关服务需自行准备与软件及相关服务有关的终端设备（如电脑，手机等装置），一旦您在其终端设备中打开“ 敏智访客“软件，即视为您使用” 敏智访客“软件及相关服务。为充分实现”
				敏智访客“的全部功能，您可能需要将其终端设备联网，您理解由您承担所需要的费用（如流量费，上网费等）。</p>

				<p>2.6我们许可您个人的，不可转让的，非独占地和非商业的合法使用“
				敏智访客”软件及相关服务的权利。本协议未明示授权的其他一切权利仍由我们保留，您在行使该些权利时须另行获得我们的书面许可，同时我们如未行使前述任何权利，并不构成对该权利的放弃。</p>

				<p>2.7您需要注册才可开始使用“ 敏智访客”软件及相关服务。同时，您也理解，为使您更好地使用“
				敏智访客”软件及相关服务，保障您的账号安全，某些功能和/或某些单项服务项目，要求您按照国家相关法律法规的规定，可能需要提供真实的身份信息实名注册并登陆后方可使用。</p>

				<p>2.8如您发现“ 敏智访客”软件及网站内存在任何侵犯您权利的内容，请立即通过邮箱2549551064@qq.com通知我们，提供您有相关权利的初步证据，我们将会根据当地法律规定及时处理您的投诉。</p>
				<br/>
				3，关于“账号”<br />

				<p>3.1“ 敏智访客”为用户提供了注册通道，用户有权选择合法的字符组合作为自己的账号，并自行设置符合安全要求的密码。用户设置的账号，密码是用户用以登录并以注册用户身份使用“ 敏智访客”软件及相关服务的凭证。</p>

				<p>3.2您理解并承诺，您所设置的账号不得违反国家法律法规及我们的相关规则，您的账号名称，头像和简介等注册信息及其他个人信息中不得出现违法和不良信息，未经他人许可不得用他人名义（包括但不限于冒用他人姓名，名称，字号，头像等足以让人引起混淆的方式）开设账号，不得恶意注册“
				敏智访客”账号（包括但不限于频繁注册，批量注册账号等行为）。您在账号注册及使用过程中需遵守相关法律法规，不得实施任何侵害国家利益，损害其他公民合法权益，有害社会道德风尚的行为。我们有权对您提交的注册信息进行审核。</p>

				<p>3.3您在“
				敏智访客”中的注册账号所有权及有关权益均归我们所有，您完成注册手续后仅享有该账号的使用权。您的账号仅限于您本人使用，未经我们书面同意，禁止以任何形式赠与，借用，出租，转让，售卖或以其他方式许可他人使用该账号。如果我们发现或者有合理理由认为使用者并非账号初始注册人，我们有权在未通知您的情况下，暂停或终止向该注册账号提供服务，并有权注销该账号，而无需向注册该账号的用户承担法律责任。</p>

				<p>3.4您有责任维护个人账号，密码的安全性与保密性，并对您以注册账号名义所从事的活动承担全部法律责任，包括但不限于您在“
				敏智访客”上进行的任何数据修改，言论发表等操作行为。您应高度重视对账号与密码的保密，在任何情况下不向他人透露账号及密码。若发现他人未经许可使用您的账号或发生其他任何安全漏洞问题时，您应当立即通知我们。

				<p>3.5您的账号在丢失或遗忘密码后，可遵照我们的申诉途径及时申诉请求找回账号或密码。您理解并认可，我们的密码找回机制仅需要识别申诉单上所填资料与系统记录资料具有一致性，而无法识别申诉人是否系真正账号有权使用者。我们特别提醒您应妥善保管您的账号和密码。当您使用完毕后，应安全退出。因您保管不当可能导致遭受盗号或密码丢失，责任由您自行承担。</p>

				<p>3.6在注册，使用和管理账号时，您应保证注册账号时填写的身份信息的真实性，请您在注册，管理账号时使用真实，准确，合法，有效的相关身份证明材料及必要信息（包括您的姓名，身份证等）。依照国家法律法规的规定，为使用本软件及服务，您需要填写真实的身份信息，请您按照相关法律规定完成实名认证，并注意及时更新上述相关信息。若您提交的材料或提供的信息不准确，不真实，不合法或者我们有理由怀疑为错误，不实或不合法的资料，则我们有权拒绝为您提供相关服务或您可能无法使用“
				敏智访客”软件及相关服务或在使用过程中部分功能受到限制。</p>

				<p>3.7因其他人恶意攻击或您自身原因或其他不可抗因素而导致账号被盗，丢失，均由您本人承担责任，我们不承担任何责任。</p>

				<p>3.8您理解，为了充分使用账号资源，如您在注册后未及时进行初次登录使用或连续超过二个月未登录闲置账号的使用等情形，我们有权随时收回您账号。</p>
				<br/>
				4用户个人信息保护<br />

				<p>4.1我们与用户一同致力于用户个人信息（即能够独立或与其他信息结合后识别用户身份的信息）的保护，保护用户个人信息是我们的基本原则之一。未经用户同意，我们不会向我们以外的任何我们，组织和个人披露您的个人信息，但法律法规及本协议另有规定的除外。</p>

				<p>4.2我们将运用与“ 敏智访客”软件及相关服务相匹配的安全技术及其他安全措施并建立完善的管理制度来保护您的个人信息。</p>

				<p>4.3您可随时浏览，修改自己提交的个人身份信息，您理解并同意出于安全性和身份识别（如账号或密码找回申诉服务等）的考虑，您可能无法修改注册时提供的初始注册信息及其他验证信息。</p>

				<p>4.4我们不会将您的个人信息转移或披露给第三方，除非：<br />

						<p style="text-indent: 3em;">（ 1）事先获得您的明确授权;</p><br />

						（ 2）您分享的信息;<br />

						（ 3）根据有关的法律法规规定或按照司法，行政等国家机关的要求;<br />

						（ 4）出于实现我们向您提供服务所必需的目的，向我们的关联方，合作伙伴分享提供服务所必需的个人信息，我们及其关联方，合作伙伴无权将共享的个人信息用于任何其他用途;<br />

						（ 5）以维护公共利益或学术研究为目的;<br />

						（ 6）为维护“ 敏智访客”其他用户，我们及其关联我们，控制我们，继承我们的合法权益，例如查找，预防，处理欺诈或安全方面的问题;<br />
						
						（ 7）我们为维护合法权益而向用户提起诉讼或仲裁;<br />

						（ 8）在涉及合并，分立，收购，资产转让或类似的交易时，如涉及到个人信息转让，我们会要求新的持有您的个人信息的我们，组织继续受本隐私政策的约束，否则，我们有权要求该我们，组织重新取得您的授权同意;<br />

						（ 9）符合本协议相关条款的规定。<br />
				</p>
				<br/>
				5，用户行为规范<br/>

				<p>5.1用户行为要求

				您应对其使用本产品及相关服务的行为负责，除非法律允许或者经我们事先书面许可，您使用 “ 敏智访客”软件及相关服务不得具有下列行为：</p>

				<p>5.1.1使用未经我们授权或许可的任何插件，外挂，系统或第三方工具对“ 敏智访客”软件及相关服务的正常运行进行干扰，破坏，修改或施加其他影响。</p>

				<p>5.1.2利用或针对“ 敏智访客”软件及相关服务进行任何危害计算机网络安全的行为，包括但不限于：</p> <br />

				（ 1）非法侵入他人网络，干扰他人网络正常功能，窃取网络数据等危害网络安全的活动;<br />

				（ 2）提供专门用于从事侵入网络，干扰网络正常功能及防护措施，窃取网络数据等危害网络安全活动的程序，工具;<br />

				（ 3）明知他人从事危害网络安全的活动的，为其提供技术支持，广告推广，支付结算等帮助<br />

				（ 4）使用未经许可的数据或进入未经许可的服务器/账号;<br />

				（ 5）未经允许进入公众计算机网络或者他人计算机系统并删除，修改，增加存储信息;<br />

				（ 6）未经许可，企图探查，扫描，测试“ 敏智访客”系统或网络的弱点或其它实施破坏网络安全的行为;<br />

				（ 7）企图干涉，破坏“ 敏智访客”系统或网站的正常运行，故意传播恶意程序或病毒以及其他破坏干扰正常网络信息服务的行为;<br />

				（ 8）伪造TCP / IP数据包名称或部分名称。<br />

				<p>5.1.3对“ 敏智访客”软件进行反向工程，反向汇编，编译或者以其他方式尝试发现本软件的源代码。</p>

				<p>5.1.4恶意注册“ 敏智访客” 账号，包括但不限于频繁，批量注册账号。</p>

				<p>5.1.5违反法律法规，本协议，我们的相关规则及侵犯他人合法权益的其他行为。</p>

				在任何情况下，如果我们有理由认为您的任何行为违反或可能违反上述约定的，我们可独立进行判断并处理，且在任何时候有权在进行任何事先通知的情况下终止向用户提供服务，并追究相关责任。</p>

				<p>5.2信息内容规范</p>

				<p>5.2.1用户按规定完成实名认证后，可以以注册账号或“ 敏智访客”合作平台账号登录“ 敏智访客”发起预约，查看预约记录等。</p>

				6，“ 敏智访客”数据使用规范<br />

				<p>6.1未经我们书面许可，用户不得自行或授权，允许，协助任何第三人对本协议“ 敏智访客”软件及相关服务中信息内容进行如下行为：

				（ 1）复制，读取，采用“ 敏智访客”软件及相关服务的信息内容，用于包括但不限于宣传，增加阅读量，浏览量等商业用途;<br />

				（ 2）擅自编辑，整理，编排“ 敏智访客”软件及相关服务的信息内容后在敏智访客软件及相关服务的源页面以外的渠道进行展示;<br />

				（ 3）采用包括但不限于特殊标识，特殊代码等任何形式的识别方法，自行或协助第三人对“ 敏智访客”软件及相关服务的信息或内容产生流量，阅读量引导，转移，劫持等不利影响;<br />

				（ 4）其他非法获取“ 敏智访客”软件及相关服务的信息内容的行为。<br />

				<p>6.2经我们书面许可后，用户对“ 敏智访客”软件及相关服务的信息和内容的分享，转发等行为，还应符合以下规范：</p> <br />

				（ 1）对抓取，统计，获得的相关留存率，付费，注册量等相关数据，未经我们事先书面同意，不得将上述数据以任何方式公示，提供，泄露给任何第三人;<br />

				（ 2）不得对“ 敏智访客”软件及相关服务进行任何形式的任何改动，包括但不限于“ 敏智访客”软件及相关服务的充值入口，也不得对“ 敏智访客”软件及相关服务的源页面的展示进行任何形式的遮挡，插入，弹窗等妨碍;<br />

				（ 3）应当采取安全，有效，严密的措施，防止“ 敏智访客”软件及相关服务的信息内容被第三方通过包括但不限于“蜘蛛”（spider）程序等任何形式进行非法获取;<br />

				（ 4）不得把相关数据内容用于我们书面许可范围之外的目的，进行任何形式的销售和商业使用，或向第三方泄露，提供或允许第三方为任何方式的使用。<br />

				（ 5）用户向任何第三人分享，转发，复制“ 敏智访客”软件及相关服务信息内容的行为，还应遵守我们为此制定的其他规范和标准。<br />

				7，违约处理<br />

				<p>7.1针对您违反本协议或其他服务条款的行为，我们有权独立判断并视情况采取预先警示，短期禁止发言，限制账号部分或者全部功能直至永久关闭账号等措施。我们有权公告处理结果有权根据实际情况决定是否恢复使用。对涉嫌违反法律法规，涉嫌违法犯罪的行为将保存有关记录，并依法向有关主管部门报告，配合有关主管部门调查。对已删除内容我们有权不予返还。</p>

				<p>7.2因您违反本协议或其他服务条款规定，引起第三方投诉或诉讼索赔的，您应当自行承担全部法律责任。因您的违法或违约行为导致我们及其关联我们，控制我们，继承我们向任何第三方赔偿或遭受国家机关处罚的，您还应足额赔偿我们及其关联我们，控制我们，继承我们因此遭受的全部损失。</p>

				<p>7.3我们尊重并保护法人，公民的知识产权，名誉权，姓名权，隐私权等合法权益。您保证，在使用“
				敏智访客”软件及相关服务时上传的文字，视频，音频等不侵犯任何第三方的知识产权，名誉权，姓名权，隐私权等权利及合法权益。否则，我们有权在收到权利方或者相关方通知的情况下移除该涉嫌侵权内容。针对第三方提出的全部权利主张，您应自行承担全部法律责任;如因您的侵权行为导致我们及其关联我们，控制我们，继承我们遭受损失的（包括但不限于经济，商誉等损失），您还应足额赔偿我们及其关联我们，控制我们，继承我们遭受的全部损失。</p>

				8服务的变更，中断和终止<br />

				<p>8.1您理解并同意，我们提供的“
				敏智访客”软件及相关服务是按照现状技术和条件所能达到的现状提供的。我们会尽最大努力向您提供服务，确保服务的连贯性和安全性。您理解，我们不能随时预见和防范法律，技术以及其他风险，包括但不限于不可抗力，病毒，木马，黑客攻击，系统不稳定，第三方服务瑕疵及其他各种安全问题的侵扰等原因可能导致的服务中断，数据丢失以及其他的损失和风险。

				<p>8.2您理解并同意，我们为了服务整体运营的需要，有权在公告通知后修改，中断，中止或终止“ 敏智访客”软件及相关服务，而无须向用户负责或承担任何赔偿责任。</p>

				9，隐私政策<br />

				“ 敏智访客”非常重视用户信息的保护，在使用“ 敏智访客”软件及相关服务前，我们可能会收集和使用您的相关信息，请您务必仔细阅读本隐私政策。您一旦选择使用“
				敏智访客”软件及相关服务，即意味着同意我们按照本隐私政策收集，使用（含商业合作使用），储存和分享您的相关信息。

				<p>9.1信息可能收集的范围与方式</p>

				<p>9.1.1我们提供服务时，可能会收集，储存和使用下列与您有关的信息。如果您不提供相关信息，无法可能注册成为敏智访客的用户或无法享受我们提供的某些服务，或者无法达到相关服务拟达到的效果。</p>

				<p>9.1.2您理解并同意当您使用“ 敏智访客”软件及相关服务时填写和/或提供的信息，可能包括姓名，性别，联系方式等单独或者结合识别用户身份的信息。您可以选择不提供某一或某些信息，但是这样可能使您无法使用“ 敏智访客”的相关特殊服务。</p>

				<p>9.2因您使用“ 敏智访客”软件及相关服务获取的信息。</p>

				<p>9.2.1日志信息</p>

				（ 1）当您使用“
				敏智访客”产品或服务时，为使您获得更轻松的访问体验，我们可能会使用各种技术来收集和存储信息，在此过程中可能会向您的设备发送一个或多个的Cookie或匿名标识符。这么做是为了了解您的使用习惯，使您省去重复输入注册信息等步骤，或帮助判断您的账户安全。</p>

				（ 2）当您使用“ 敏智访客”产品或服务时，我们可能会利用Cookie和同类技术收取您的信息用于了解您的偏好，进行咨询或数据分析，改善产品服务即用户体验，提高广告效果，及时发现并防范安全风险，为用户和合作伙伴提供更好的服务。</p>

				（ 3）我们不会将Cookie用于本隐私政策所述目的之外的任何用途，您可以根据自己的偏好留存或删除Cookie。您可清除软件或网页中保存的所有Cookie，当您手动清除后，您的相关信息即已删除。</p>

				<p>9.3信息使用</p>

				<p>9.3.1通过使用收集的信息，我们会得以向您提供个性化的服务并改善现有服务。</p>

				<p>9.3.2通过使用收集的信息，向您提供更加相关广告以替代普遍投放的广告。</p>

				<p>9.3.3可能我们会与敏智访客关联我们，控制我们及其他合作方共同向您提供您所要求的服务或内容。在服务或内容为该项产品
				/服务所必须的情况下，您同意我们可与其分享您的个人信息，并且我们将努力确保该第三方在使用您的个人信息时同时遵守本隐私政策以及其他的保密及安全义务。</p>


				<p>9.4信息安全</p>

				<p>9.4.1。我们非常重视信息安全，我们努力为您的信息安全提供保障，以防止您的信息被不当使用或被未经授权的访问，使用或泄漏。</p>

				<p>9.4.2我们将在合理和安全水平内使用各种安全保护措施，例如我们会使用加密技术（例如SSL），匿名化处理等手段保护您的个人信息。</p>

				<p>9.4.3我们建立专门的数据安全部门，安全管理制度，采取流程保障您的个人信息安全。采取严格的数据使用和访问制度，采取专门的数据和技术安全审计。对个人信息泄露等安全事件，我们会启动应急预案，阻止安全事件扩大，并以推送，公告等形式告知您。</p>

				<p>9.4.4尽管已经采取了上述合理有效措施，并已经遵守了相关法律规定要求的标准，但请您理解，由于技术的限制以及可能存在的各种恶意手段，在互联网行业，即便竭尽所能加强安全措施，也不可能始终保证信息百分之百的安全。您需要了解，您接入我们的服务所用的系统和通讯网络，有可能因我们可控范围外的因素而出现问题。因此，您应采取积极措施保护个人信息的安全。</p>

				<p>9.5本隐私政策条款不适用于以下情况：</p> <br />

				<p>9.5.1通过“ 敏智访客”软件及相关服务而接入的第三方服务（包括任何第三方应用及网站）收集的信息;</p>

				<p>9.5.2通过在“ 敏智访客”软件及相关服务中进行广告服务的其他我们或机构，组织所收集的信息。</p>

				<p>9.6我们的服务可能包括或链接至第三方提供的信息或其他服务（包括网站）。该等第三方服务可能由相关的第三方运营。您使用该等第三方服务（包括您向该等第三方提供的任何个人信息），须受该第三方的服务条款及隐私政策（而非本隐私政策）约束，您需要仔细阅读其条款。请您妥善保护自己的个人信息，仅在必要的情况下向他人提供。本隐私政策仅适用于我们所收集，保存，使用的信息，并不适用于任何第三方提供的服务或第三方的信息使用规则，我们对任何第三方使用由您提供的信息不承担任何责任。</p>

				10，免责声明<br />

				<p>10.1您理解并同意，“ 敏智访客”软件及相关服务可能会受多种因素的影响或干扰，我们不保证（包括但不限于）：</p> <br />

				<p>10.1.1我们完全适合用户的使用要求;</p>

				<p>10.1.2我们不受干扰，及时，安全，可靠或不出现错误;用户经由我们取得的任何软件，服务或其他材料符合用户的期望;</p>

				<p>10.1.3软件中任何错误都将能得到更正。</p>

				<p>10.2对于涉及借款或其他涉财产的网络信息，账户密码，广告或推广等信息的，用户请谨慎对待并自行进行判断，基于前述原因您因此遭受的利润，商业信誉，资料损失或其他有形或无形损失，我们不承担任何直接，间接，附带，特别，衍生性或惩罚性的赔偿责任。</p>

				<p>10.3用户理解并同意，在使用“
				敏智访客”软件及相关服务过程中，可能遇到不可抗力等因素（不可抗力是指不能预见，不能克服并不能避免的客观事件），包括但不限于政府行为，自然灾害，网络原因，黑客攻击，战争或任何其它类似事件。出现不可抗力情况时，我们将努力在第一时间及时修复，但因不可抗力给用户造成了损失，用户同意我们不承担责任…</p>

				<p>10.4我们依据本协议约定获得处理违法违规内容的权利，该权利不构成我们的义务或承诺，我们不能保证及时发现违法行为或进行相应处理。</p>

				<p>10-.5用户明确了解并同意：关于本协议服务，我们不提供任何种类的明示或暗示担保或条件，包括但不限于商业适售性，特定用途适用性等。您对本协议软件及相关服务的使用行为必须自行承担相应风险。</p>

				<p>10.6用户明确了解并同并，本协议是在保障遵守国家法律法规，维护公序良俗，保护他人合法权益，我们在能力范围内尽最大的努力按照相关法律法规进行判断，但并不保证我们判断完全与司法机关，行政机关的判断一致，如因此产生的后果用户已经理解并同意自行承担。</p>

				11，关于单项服务的特殊约定<br />

				<p>11.1“ 敏智访客”软件及相关服务中包含我们以各种合法方式获取的信息或信息内容链接，同时也包括我们及其关联我们合法运营的其他单项服务。这些服务在“
				敏智访客“可能以单独板块形式存在。我们有权不时地增加，减少或改动这些特别板块的设置及服务。</p>

				<p>11.2您可以在“
				敏智访客”软件中开启和使用上述单项服务功能。某些单项服务可能需要您同时接受就该服务特别制订的协议或者其他约束您与该项服务提供者之间的规则。我们将以醒目的方式提供这些协议，规则供您查阅。一旦您开始使用上述服务，则视为您同时受有关单项服务的相关协议，规则的约束。</p>

				<p>11.3如您可能在“ 敏智访客”软件中使用第三方提供的软件及相关服务时，除遵守本协议及本敏智访客相关规则外，还应遵守第三方的协议，相关规则。因第三方软件及相关服务产生的争议，损失或损害，由用户与第三方解决。</p>

				12，其他<br />

				<p>12.1本协议的成立，生效，履行，解释及争议的解决均应适用中华人民共和国大陆地区法律。倘本协议之任何规定因与中华人民共和国大陆地区的法律抵触而无效，则这些条款将尽可能接近本协议原条文意旨重新解析，且本协议其它规定仍应具有完整的效力及效果。</p>

				<p>12.2本协议的签署地点为中华人民共和国长沙市芙蓉区，若您与我们发生争议的，双方应尽量友好协商解决，协商不成，您同意应将争议提交至长沙市芙蓉区法院管辖。</p>

				<p>12.3我们有权依据国家政策，技术条件，产品功能等变化需要而进行修改本协议，我们会将修改后的协议予以发布。前述内容一经正式发布，并以适当的方式送达用户（网站公布，系统通知等），即为本协议不可分割的组成部分，您应同样遵守。您对修改后的协议有异议的，请立即停止登录，使用“
				敏智访客”软件及相关服务，若您登录或继续使用“ 敏智访客”软件及相关服务，视为认可修改后的协议。</p>

				<p>12.4本协议中的标题仅为方便及阅读而设，并不影响本协议中任何规定的含义或解释。</p>

				<p>12.5您和我们均是独立的主体，在任何情况下本协议不构成我们对用户的任何形式的明示或暗示担保或条件，双方之间亦不构成代理，合伙，合营或雇佣关系。</p>

				<p>12.6本协议的版权为我们所有，我们保留一切解释和修改的权利。</p>
			</scroll-view>

		</view>
	</view>
</template>

<script>
	export default {
		data() {
			return {
				scrollTop: 0,
				old: {
					scrollTop: 0,
				}
			}
		},
		props: {
			text: null,
			data: null,
			bgflag: false,
		},
		onLoad() {
			console.log(this.data)
		},
		methods: {
			  scroll(e) {
			                this.old.scrollTop = e.detail.scrollTop
			            },
			            goTop() {
			                //这里必须将this.old.scrollTop值赋值给this.scrollTop
			                this.scrollTop = this.old.scrollTop;
			                this.$nextTick(function() {
			                    this.scrollTop = 0
			                });
			            },
			            upper(){
			                // 滚动到顶部/左边触发
			            },
			            lower(){
			                // 滚动到底部/右边触发
			            }
			        },
			
			
		}
</script>

<style lang="scss">
	p{
		text-indent: 2em;
	}
	
	#left {
		left: 20rpx
	}
	.scroll-view{
		 height: 100%;
		 width: 100%;
	}
	
	#bgflag1 {
		background-color: #2cffe0;
		color: #fff;
	}

	.mask {
		width: 100vw;
		height: 100vh;
		background: rgba(0, 0, 0, .5);
		position: fixed;
		top: 0;
		left: 0;
		z-index: 9999;
		color: #000000;

	}

	.yinghangka {
		width: 70vw;
		position: absolute;
		left: 50%;
		top: 50%;
		transform: translate(-50%, -50%);
		background-color: #FFFFFF;
		height: 65vh;

	}
</style>
